In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv.csv', skiprows=[r for r in range(6608,6611)] )

In [3]:
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  2190.240321              NaN
1     Afghanistan  2017  2202.570851              NaN
2     Afghanistan  2016  2200.764487              NaN
3     Afghanistan  2015  2212.750899              NaN
4     Afghanistan  2014  2249.253738              NaN
5     Afghanistan  2013  2264.317575              NaN

In [4]:
internet_df = pd.read_csv('../data/internet_use.csv.csv', skiprows=[r for r in range(4496,4688)])

In [5]:
internet_df.tail()

     Country or Area  Year     Value  Value Footnotes
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [6]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [7]:
internet_df.shape

(4495, 4)

In [8]:
gdp_df.shape

(6606, 4)

In [9]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6596        Zimbabwe  1999  3600.849291              NaN
6597        Zimbabwe  1998  3653.920016              NaN
6598        Zimbabwe  1997  3580.048793              NaN
6599        Zimbabwe  1996  3520.430146              NaN
6600        Zimbabwe  1995  3226.413930              NaN
6601        Zimbabwe  1994  3263.934978              NaN
6602        Zimbabwe  1993  3033.504852              NaN
6603        Zimbabwe  1992  3054.889178              NaN
6604        Zimbabwe  1991  3426.598094              NaN
6605        Zimbabwe  1990  3324.348171              NaN

In [10]:
gdp_df.drop(columns= 'Value Footnotes', inplace = True)

In [11]:
internet_df.drop(columns='Value Footnotes', inplace = True)

In [12]:
gdp_df = gdp_df.rename(columns={'Country or Area':'Country','Value':'GDP_Per_Capita'})

In [13]:
internet_df = internet_df.rename(columns={'Country or Area':'Country','Value':'Internet_Users_Pct'})

In [14]:
gdp_df.tail()

       Country  Year  GDP_Per_Capita
6601  Zimbabwe  1994     3263.934978
6602  Zimbabwe  1993     3033.504852
6603  Zimbabwe  1992     3054.889178
6604  Zimbabwe  1991     3426.598094
6605  Zimbabwe  1990     3324.348171

In [15]:
gdp_and_internet_use = gdp_df.merge(internet_df, on=["Country","Year"], how='outer')

In [16]:
gdp_and_internet_use.head(5)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     2190.240321                 NaN
1  Afghanistan  2017     2202.570851                 NaN
2  Afghanistan  2016     2200.764487                 NaN
3  Afghanistan  2015     2212.750899                 NaN
4  Afghanistan  2014     2249.253738                6.39

In [17]:
gdp_and_internet_use.tail(5)

     Country  Year  GDP_Per_Capita  Internet_Users_Pct
7659   Yemen  1999             NaN            0.056629
7660   Yemen  1998             NaN            0.023323
7661   Yemen  1997             NaN            0.015025
7662   Yemen  1996             NaN            0.000621
7663   Yemen  1990             NaN            0.000000

In [18]:
gdp_and_internet_use_subset_years = gdp_and_internet_use.query('Year == 2004 or Year == 2009 or Year == 2014')

In [19]:
gdp_and_internet_use_subset_years.head()

        Country  Year  GDP_Per_Capita  Internet_Users_Pct
4   Afghanistan  2014     2249.253738            6.390000
9   Afghanistan  2009     1881.777626            3.550000
14  Afghanistan  2004     1284.127338            0.105809
21      Albania  2014    11828.232264           60.100000
26      Albania  2009    10528.778102           41.200000

In [20]:
gdp_and_internet_use_2004 = gdp_and_internet_use_subset_years.query('Year == 2004')

In [22]:
gdp_and_internet_use_2009 = gdp_and_internet_use_subset_years.query('Year == 2009')

In [23]:
gdp_and_internet_use_2014 = gdp_and_internet_use_subset_years.query('Year == 2014')

In [24]:
gdp_and_internet_use_2004.head()

                 Country  Year  GDP_Per_Capita  Internet_Users_Pct
14           Afghanistan  2004     1284.127338            0.105809
31               Albania  2004     7738.542836            2.420388
60               Algeria  2004     9898.310490            4.634475
89                Angola  2004     5568.959139            0.464815
118  Antigua and Barbuda  2004    18742.463741           24.266544

In [25]:
gdp_and_internet_use_2009.head()

                 Country  Year  GDP_Per_Capita  Internet_Users_Pct
9            Afghanistan  2009     1881.777626                3.55
26               Albania  2009    10528.778102               41.20
55               Algeria  2009    10610.711405               11.23
84                Angola  2009     7610.310423                6.00
113  Antigua and Barbuda  2009    19989.092913               42.00

In [26]:
gdp_and_internet_use_2014.head()

                 Country  Year  GDP_Per_Capita  Internet_Users_Pct
4            Afghanistan  2014     2249.253738                6.39
21               Albania  2014    11828.232264               60.10
50               Algeria  2014    11329.428688               18.09
79                Angola  2014     8239.832077               21.26
108  Antigua and Barbuda  2014    18104.241470               64.00

In [30]:
gdp_and_internet_use_2009.max()

Country               Zimbabwe
Year                      2009
GDP_Per_Capita          105078
Internet_Users_Pct          93
dtype: object